{"metadata" : null, "inputs" : {"message": "Good morning, I'm looking to buy the VBT2345 Vibrant Tote bag. My name is Jessica and I love tote bags, they're so convenient for carrying all my stuff. Last summer I bought this really cute straw tote that I used at the beach. Oh, and a few years ago I got this nylon tote as a free gift with purchase that I still use for groceries.", "subject": "Buy Vibrant Tote with noise"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hey, hope you're doing well. Last year for my birthday, my wife Emily got me a really nice leather briefcase from your store. I loved it and used it every day for work until the strap broke a few months ago. Speaking of broken things, I also need to get my lawnmower fixed before spring. Anyway, what were some of the other messenger bag or briefcase style options you have? I could go for something slightly smaller than my previous one. Oh and we also need to make dinner reservations for our anniversary next month. Maybe a nice Italian place downtown. What was I saying again? Oh right, work bags! Let me know what you'd recommend. Thanks!", "subject": "Rambling About a New Work Bag"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hi, this is Liz. Please send me 5 CLF2109 Cable Knit Beanies and 2 pairs of FZZ1098 Fuzzy Slippers. I'm prepping some holiday gift baskets.", "subject": "Order for Beanies, Slippers"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hey there, I was thinking of ordering a pair of CBT8901 Chelsea Boots, but I'll wait until Fall to actually place the order. My name is Sam and I need some new boots for the colder months.", "subject": ""}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hi! I'm ready to place my order for those amazing bags I saw in your latest collection - you know, the ones with the geometric patterns that everyone's been talking about on Instagram? I want to get 3 of them, preferably in the darker shade you showed in your social media posts last week. I have the cash ready to go, just let me know where to send it! Can't wait to get my hands on them. Thanks, Monica", "subject": "Placing My Order Today"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hello I'd like to buy 2 pairs of the retro sun glasses (RSG8901). Thanks", "subject": ""}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hey there, I would like to buy Chelsea Boots [CBT 89 01] from you guys! You're so awesome I'm so impressed with the quality of Fuzzy Slippers - FZZ1098 I've bought from you before. I hope the quality stays. I would like to order Retro sunglasses from you, but probably next time! Thanks", "subject": "Hi"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hello I'd like to know how much does Saddle bag cost and if it is suitable for spring season? Thank you, Antonio", "subject": "Price check"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "After weeks of consideration, I've made up my mind! Looking at my bank account right now, and I'm prepared to commit to those CGN2345 Cargo Pants - all 5 of them, exactly as we discussed in my previous emails about the color options and material details. Just need you to confirm the availability first, before we move formward.", "subject": "Final Decision Made"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Good morning, I'm looking for a nice bag for my husband Thomas for our anniversary. He has a professional office job, but also likes outdoor activities on weekends. Which men's bag would you recommend that's both stylish and practical? Something he can use for work but also take on hikes. Thank you in advance!", "subject": "Stylish Yet Practical Men's Bag Recommendation"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Please send me 1 Sleek Wallet. Thanks, Johny", "subject": "Sleek Wallet Order"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hello, I'm looking for a dress for a summer wedding I have coming up. My name is Claire. I don't want anything too short, low-cut, or super tight-fitting. But I also don't want it to be too loose or matronly. Something flattering but still comfortable to wear for an outdoor ceremony. Any recommendations on some options that might work for me? Thank you! And bag, I think I need some travel bag.", "subject": "Summer Wedding Guest Dress Preferences"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hi, my name is Marco and I need to buy a pair of slide sandals for men, in the Men's Shoes category, for the summer.", "subject": "Shopping for Men's Sandals"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "So I've bought quite large collection of vintage items from your store: SDE2345, DJN8901, RGD7654, CRD3210, those are perfect fit for my style! I need your advice if there are any winter hats in your store? Thank you!", "subject": ""}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hi there I want to place an order for that popular item you sell. The one that's been selling like hotcakes lately. You know what I mean right?", "subject": ""}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hola, tengo una pregunta sobre el DHN0987 Gorro de punto grueso. ¿De qué material está hecho? ¿Es lo suficientemente cálido para usar en invierno? Gracias de antemano.", "subject": "Pregunta Sobre Gorro de Punto Grueso"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hello, I'd want to order one of your Versatile Scarves, the one that can be worn as a scarf, shawl, or headwrap. Thanks!", "subject": "Ordering a Versatile Scarf-like item"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hello, I need a new bag to carry my laptop and documents for work. My name is David and I'm having a hard time deciding which would be better - the LTH1098 Leather Backpack or the Leather Tote? Does one have more organizational pockets than the other? Any insight would be appreciated!", "subject": "Need your help"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hi there, The description for the RSG8901 Retro Sunglasses says they offer 'a cool, nostalgic vibe'. What era are they inspired by exactly? The 1950s, 1960s? I'm just curious about the style inspiration. Thank you!", "subject": "Question on Retro Sunglasses Description"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hi, I'd like to order three to four SFT1098 Infinity Scarves please. My wife loves collecting scarves in different colors and patterns.", "subject": "Buy Infinity Scarves Order"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Good day, For the CSH1098 Cozy Shawl, the description mentions it can be worn as a lightweight blanket. At $22, is the material good enough quality to use as a lap blanket? Or is it more like a thick wrapping scarf? I'm considering buying it as a gift for my grandmother. Thank you!", "subject": "Inquiry on Cozy Shawl Details"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hi there, I want to order all the remaining LTH0976 Leather Bifold Wallets you have in stock. I'm opening up a small boutique shop and these would be perfect for my inventory. Thank you!", "subject": "Leather Wallets"}, "outputs" : {}}
{"metadata" : null, "inputs" : {"message": "Hello, I would like to order 1 pair of RSG8901 Retro Sunglasses. Thanks!", "subject": "Purchase Retro Sunglasses"}, "outputs" : {}}
